# Запит кількості автомобілів
n = int(input("Введіть кількість автомобілів: "))

# Список для зберігання даних про кожен автомобіль
cars = []

# Збір даних для кожного автомобіля
for i in range(1, n + 1):
  print(f"\nАвтомобіль {i}:")
  name = input("Назва автомобіля: ")
  speed = int(input("Швидкість автомобіля (км/год): "))
  cars.append({"name": name, "speed": speed})

print()

# Обробка та виведення результатів
for car in cars:
  name = car["name"]
  speed = car["speed"]

  if speed <= 60:
    print(f"Автомобіль {name}: Швидкість в нормі.")
  elif speed <= 80:
    print(f"Автомобіль {name}: Штраф 500 грн за перевищення швидкості.")
  else:
    print(f"Автомобіль {name}: Штраф 1000 грн за перевищення швидкості.")
